Revit 2024 API
UIThemeManager Class
 Manager object for the UITheme class.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public static class UIThemeManager
Visual Basic
Public NotInheritable Class UIThemeManager
Visual C++
public ref class UIThemeManager abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.UI.UIThemeManager
See Also
UIThemeManager Members
Autodesk.Revit.UI Namespace